//==================================================================================
//==                                                                              ==
//==                               VAGON ENGENHARIA                               ==
//==                                                                              ==
//==------------------------------------------------------------------------------==
//==              ==================================================              ==
//==                               == BB-LoRa-24 ==                               ==
//==              ==================================================              ==
//==------------------------------------------------------------------------------==

//==                                                                              ==
//== Módulo     : Interrupt.h                                                     ==
//== Descrição  : Módulo de Inicialização e Tratamento das Interrupções           ==
//==                                                                              ==
//==------------------------------------------------------------------------------==
//==                                                                              ==
//== Autor      : Nilton Gomes Valente - VAGON Engenharia LTDA                    ==
//== Email      : nilton@vagon.com.br                                             ==
//==                                                                              ==
//==================================================================================

//==================================================================================
//== INCLUDES                                                                     ==
//==================================================================================
#include <p24F16KL402.h>

//==================================================================================
//== DECLARAÇÃO DOS PROTÓTIPOS DAS FUNÇÕES                                        ==
//==================================================================================
void INTERRUPT_TIMER1Init(void);
void INTERRUPT_TIMER1On(void);

//==================================================================================
//== DEFINIÇÕES                                                                   ==
//==================================================================================
//---------------------------------------------------------
//-- Definição das Bases de Tempo relacionados ao TIMER2 --
//-- Interrupção do TIMER2 = 1ms                         --
//---------------------------------------------------------
#define K_TEMPO_2_ms           2 //-- (    2 * 1ms =  2ms)
#define K_TEMPO_5_ms           5 //-- (    5 * 1ms =  5ms)
#define K_TEMPO_10_ms         10 //-- (   10 * 1ms = 10ms)
#define K_TEMPO_20_ms         20 //-- (   20 * 1ms = 20ms)
#define K_TEMPO_50_ms         50 //-- (   50 * 1ms = 50ms)
#define K_TEMPO_100_ms       100 //-- (  100 * 1ms = 100ms)
#define K_TEMPO_200_ms       200 //-- (  200 * 1ms = 200ms)
#define K_TEMPO_250_ms       250 //-- (  200 * 1ms = 200ms)
#define K_TEMPO_300_ms       300 //-- (  500 * 1ms = 500ms)
#define K_TEMPO_400_ms       400 //-- (  500 * 1ms = 500ms)
#define K_TEMPO_500_ms       500 //-- (  500 * 1ms = 500ms)
#define K_TEMPO_1_s         1000 //-- ( 1000 * 1ms = 1s)

#define K_TMP_CTRL_2_s         2 //-- (    2 * 1s =   2s)
#define K_TMP_CTRL_5_s         5 //-- (    5 * 1s =   5s)
#define K_TMP_CTRL_10_s       10 //-- (   10 * 1s =  10s)
#define K_TMP_CTRL_20_s       20 //-- (   20 * 1s =  20s)
#define K_TMP_CTRL_30_s       30 //-- (   30 * 1s =  30s)
#define K_TMP_CTRL_40_s       40 //-- (   40 * 1s =  40s)
#define K_TMP_CTRL_50_s       50 //-- (   50 * 1s =  50s)
#define K_TMP_CTRL_60_s       60 //-- (   60 * 1s =  60s)
#define K_TMP_CTRL_70_s       70 //-- (   70 * 1s =  70s)
#define K_TMP_CTRL_80_s       80 //-- (   80 * 1s =  80s)
#define K_TMP_CTRL_90_s       90 //-- (   90 * 1s =  00s)
#define K_TMP_CTRL_100_s     100 //-- (  100 * 1s = 100s)

//==================================================================================
//== VARIÁVEIS GLOBAIS                                                            ==
//==================================================================================
extern unsigned int     wTimer1ContadorTempo_ms;
extern unsigned char    byFlagTempo_ms;

extern unsigned int     wTimer1ContadorTempo1s;

extern unsigned int     wContadorTempo_s;
extern unsigned char    byFlagTempo_s;

//==================================================================================
//== Fim do arquivo Interrupt.h                                                   ==
//==================================================================================
